{
  "backend/main.mo": "Motoko canister defining user, business, customer, service item, receipt, and payment types with access-controlled CRUD operations tied to caller principals.",
  "feature_evidence.json": "Lists feature-to-file mappings and evidence metadata for implemented app functionality with feature IDs, related files, components, and confidence levels.",
  "frontend-file-summaries.txt": "Prewritten summaries describing the purpose of key frontend files including hooks, components, pages, and utilities.",
  "frontend/index.css": "Tailwind base stylesheet defining light/dark theme CSS variables and global styling rules.",
  "frontend/index.html": "Basic HTML entry point mounting the SPA root and loading the main TypeScript bundle.",
  "frontend/src/App.tsx": "Sets up routing, authentication gating, profile setup flow, and global providers for the React app.",
  "frontend/src/components/auth/LoginButton.tsx": "Authentication button handling Internet Identity login/logout and React Query cache clearing.",
  "frontend/src/components/auth/ProfileSetupModal.tsx": "Modal form allowing new authenticated users to submit and save their profile information.",
  "frontend/src/components/layout/AppLayout.tsx": "Main page layout with header, navigation, footer, and outlet for routed pages.",
  "frontend/src/components/payments/AddPaymentDialog.tsx": "Dialog component for adding a payment, validating input, constructing a Payment object, and submitting via useAddPayment.",
  "frontend/src/components/payments/PaymentsList.tsx": "Placeholder component showing payment history info, relying on parent receipt data.",
  "frontend/src/components/print/PrintableReceipt.tsx": "Renders a printable receipt with business info, items, totals, and payment history.",
  "frontend/src/hooks/useActor.ts": "Creates and caches a backend actor using the current identity, invalidating dependent queries on change.",
  "frontend/src/hooks/useBusinessProfile.ts": "Hooks for fetching and updating the business profile through the backend actor.",
  "frontend/src/hooks/useCurrentUserProfile.ts": "Hook for retrieving the caller’s user profile using the backend actor.",
  "frontend/src/hooks/useCustomers.ts": "Hooks for fetching customers and adding a new customer via backend actor.",
  "frontend/src/hooks/useInternetIdentity.ts": "Provides Internet Identity authentication state, login handling, and identity persistence.",
  "frontend/src/hooks/usePayments.ts": "Hooks to fetch a receipt's payments and add new payments, invalidating related queries.",
  "frontend/src/hooks/useReceipts.ts": "Hooks for fetching sorted receipts and creating new receipts via backend actor.",
  "frontend/src/hooks/useServiceItems.ts": "Hooks for fetching and adding service items from the backend actor.",
  "frontend/src/index.css": "Tailwind base styles and theme variables with print-specific styling rules.",
  "frontend/src/lib/money.ts": "Provides helpers for formatting and parsing currency and calculating totals and balances using bigint values.",
  "frontend/src/main.tsx": "Bootstraps the React app with React Query and the InternetIdentityProvider.",
  "frontend/src/pages/Landing/LandingPage.tsx": "Renders the marketing landing page with feature highlights and login buttons.",
  "frontend/src/pages/Receipts/ReceiptDetailPage.tsx": "Displays receipt details, line items, payments, and print options for a selected receipt.",
  "frontend/src/pages/Receipts/ReceiptFormPage.tsx": "Implements the form for creating receipts, adding customers, service items, and line items.",
  "frontend/src/pages/Receipts/ReceiptsEmptyState.tsx": "Shows an empty-state prompt encouraging users to create their first receipt.",
  "frontend/src/pages/Receipts/ReceiptsListPage.tsx": "Lists receipts with search and status filters, linking to detail pages.",
  "frontend/src/utils/urlParams.ts": "Utility functions for reading URL parameters and storing or retrieving them from sessionStorage.",
  "frontend/tailwind.config.js": "Tailwind configuration extending theme colors, fonts, animations, and container settings, with plugins for typography, container queries, and animations.",
  "project_state.json": "Project state file defining app summary, required images, and a list of existing feature definitions with versions and requirement IDs."
}